[{"language": "de", "title": "Irren ist staatlich", "event_id": 7811, "start_time": "2016-12-29T21:15:00.000+01:00", "speaker_names": "Arne Semsrott", "track_id": 316, "room_id": 380, "duration": 1800, "abstract": "Dieses Jahr feiert das Informationsfreiheitsgesetz (IFG) seinen zehnten Geburtstag – und niemand feiert mit. Zeit für eine Abrechnung. FOIA frei!"}, {"language": "en", "title": "The DROWN Attack", "event_id": 7821, "start_time": "2016-12-27T14:00:00.000+01:00", "speaker_names": "Sebastian Schinzel", "track_id": 318, "room_id": 380, "duration": 3600, "abstract": "We present DROWN, a novel cross-protocol attack on TLS that uses a server supporting SSLv2 as an oracle to decrypt modern TLS connections. Using Internet-wide scans, we find that 33% of all HTTPS servers are vulnerable to this protocol-level attack."}, {"language": "de", "title": "Einführung zu Blockchains", "event_id": 7824, "start_time": "2016-12-28T17:15:00.000+01:00", "speaker_names": "vimja", "track_id": 318, "room_id": 380, "duration": 3600, "abstract": "Blockchain ist die Technologie welche moderne Kryptowährungen ermöglicht. In dem Vortrag wird die Funktionsweise von Blockchains ganz allgemein erklären. Anhand der Bitcoin Blockchain wird ausserdem gezeigt, wie diese Funktionen in einem echten System umgesetzt werden können."}, {"language": "en", "title": "On the Security and Privacy of Modern Single Sign-On in the Web", "event_id": 7827, "start_time": "2016-12-28T18:30:00.000+01:00", "speaker_names": "Guido Schmitz (gtrs), dfett", "track_id": 318, "room_id": 381, "duration": 3600, "abstract": "<p>Many web sites allow users to log in with their Facebook or Google account. This so-called Web single sign-on (SSO) often uses the standard protocols OAuth and OpenID Connect. How secure are these protocols?  What can go wrong?</p>\r\n\r\n<p>OAuth and OpenID Connect do not protect your privacy at all, i.e., your identity provider (e.g., Facebook or Google) can always track, where you log in. Mozilla tried to create an authentication protocol that aimed to prevent tracking: BrowserID (a.k.a. Persona). Did their proposition really solve the privacy issue? What are the lessons learned and can we do better?</p>"}, {"language": "en", "title": "Do as I Say not as I Do: Stealth Modification of Programmable Logic Controllers I/O by Pin Control Attack", "event_id": 7853, "start_time": "2016-12-29T16:00:00.000+01:00", "speaker_names": "Ali Abbasi, Majid", "track_id": 318, "room_id": 382, "duration": 3600, "abstract": "Input/Output is the mechanisms through which embedded systems interact and control the outside world. Particularly when employed in mission critical systems, the I/O of embedded systems has to be both reliable and secure. Embedded system’s I/O is controlled by a pin based approach. In this work, we investigate the security implications of embedded system’s pin control. In particular, we show how an attacker can tamper with the integrity and availability of an embedded system’s I/O by exploiting cerain pin control operations and the lack of hardware interrupts associated to them. "}, {"language": "en", "title": "Exploiting PHP7 unserialize", "event_id": 7858, "start_time": "2016-12-27T12:45:00.000+01:00", "speaker_names": "Yannay Livneh", "track_id": 318, "room_id": 382, "duration": 3600, "abstract": "PHP-7 is a new version of the most prevalent server-side language in use today. Like previous version, this version is also vulnerable to memory corruptions.\r\nHowever, the language has gone through extensive changes and none of previous exploitation techniques are relevant.\r\nIn this talk, we explore the new memory internals of the language from exploiters and vulnerability researchers point of view. We will explain newly found vulnerabilities in the 'unserialize' mechanism of the language and present re-usable primitives for remote exploitation of these vulnerabilities."}, {"language": "en", "title": "Welcome to the Anthropocene?", "event_id": 7860, "start_time": "2016-12-28T13:00:00.000+01:00", "speaker_names": "KaLeiMai", "track_id": 314, "room_id": 380, "duration": 1800, "abstract": "he Anthropocene is <a href=\"http://quaternary.stratigraphy.org/workinggroups/anthropocene/\" title=\"Website of the Working Group on the &#39;Anthropocene&#39; (AWG)\">widely understood</a> to mean the current <em>&quot;period of Earth's history during which humans have a decisive influence on the state, dynamics and future&quot;</em> of this planet. For several years, scientists in the <a href=\"http://quaternary.stratigraphy.org/workinggroups/anthropocene/\" title=\"Website of the Working Group on the &#39;Anthropocene&#39; (AWG)\">Working Group on the 'Anthropocene' (AWG)</a> have <a href=\"https://www2.le.ac.uk/offices/press/press-releases/2016/august/media-note-anthropocene-working-group-awg\" title=\"Media note on AWG recommendations\">worked (and voted!)</a> on defining the beginning of the Anthropocene in geochemical terms. The mid-20<sup>th</sup> century provides an obvious geochemical 'timestamp': fallout from <a href=\"https://media.ccc.de/v/31c3_-_6121_-_en_-_saal_2_-_201412291715_-_what_ever_happened_to_nuclear_weapons_-_michael_buker\" title=\"Michael Büker&#39;s &#39;What Ever Happened to Nuclear Weapons?&#39; talk at 31c3\">nuclear weapons detonations</a>. Which other chemicals and dates are being considered for marking the Anthropocene's start? How is 'define-by-committee' even working out for <a href=\"http://www.stratigraphy.org/index.php/ics-chart-timescale\" title=\"International Chronostratigraphic Chart AKA Geological Timescale\">geological epochs</a>? What other timestamps are being considered? This talk boils the scientific background of the Anthropocene debate down for non-stratigraphers. We'll also learn about potential environmental trajectories, and the choices we and our civilisation will face in a geological epoch of our own making."}, {"language": "en", "title": "The Universe Is, Like, Seriously Huge", "event_id": 7861, "start_time": "2016-12-29T23:30:00.000+01:00", "speaker_names": "Michael Büker", "track_id": 323, "room_id": 379, "duration": 1800, "abstract": "Astronomers struggle to accurately measure distances in the vastness of the known universe. Get an insight into the sophisticated techniques and dirty tricks of today's astrophysics and cosmology. No physics background required, featuring lots of pretty space pictures."}, {"language": "en", "title": "Gone in 60 Milliseconds", "event_id": 7865, "start_time": "2016-12-28T13:45:00.000+01:00", "speaker_names": "Rich Jones", "track_id": 318, "room_id": 379, "duration": 1800, "abstract": "<p>More and more businesses are moving away from monolithic servers and turning to event-driven microservices powered by cloud function providers like AWS Lambda. So, how do we hack in to a server that only exists for <i>60 milliseconds</i>?</p>\r\n\r\n<p>This talk will show novel attack vectors using cloud event sources,  exploitabilities in common server-less patterns and frameworks, abuse of undocumented features in AWS Lambda for persistent malware injection, identifying valuable targets for pilfering, and, of course, how to exfiltrate juicy data out of a secure Virtual Private Cloud. </p>"}, {"language": "en", "title": "SpinalHDL : An alternative hardware description language", "event_id": 7873, "start_time": "2016-12-28T21:45:00.000+01:00", "speaker_names": "Dolu1990", "track_id": 317, "room_id": 382, "duration": 3600, "abstract": "Since too long we use VHDL and Verilog to describe hardware. SpinalHDL is an alternative language which does its best to prove that it is time to do a paradigm shift in hardware description."}, {"language": "en", "title": "International exchange of tax information", "event_id": 7880, "start_time": "2016-12-28T11:30:00.000+01:00", "speaker_names": "taxman", "track_id": 316, "room_id": 382, "duration": 1800, "abstract": "The Common Reporting Standard is a multinational agreement  signed by more than 80 nations, including all EU member states. The signatories promised to exchange bank account information on foreigners."}, {"language": "en", "title": "Downgrading iOS: From past to present", "event_id": 7888, "start_time": "2016-12-28T20:30:00.000+01:00", "speaker_names": "tihmstar", "track_id": 318, "room_id": 382, "duration": 3600, "abstract": "This talk is about the iOS secure boot chain and how it changed throughout different iOS versions, while focusing on downgrading despite countermesures. \r\nIt will explain basics like what SHSH blobs and APTickets are and how IMG3 and IMG4 file format works.\r\nAlso a new technique called \"prometheus\" will be introduced which allows for the first time downgrading 64bit devices."}, {"language": "de", "title": "Berechnete Welt", "event_id": 7899, "start_time": "2016-12-29T20:30:00.000+01:00", "speaker_names": "Karl Urban", "track_id": 316, "room_id": 381, "duration": 1800, "abstract": "Wer all unsere Daten der Gegenwart mit selbstlernenden Algorithmen auswertet, wird die nahe Zukunft grob vorhersagen können. Die Instrumente dafür sind so weit, viele seriöse Forscher arbeiten an Teilbruchstücken. Die Folgen für die Gesellschaft scheinen fatal zu sein. Orwell naht gewaltig."}, {"language": "en", "title": "Pegasus internals", "event_id": 7901, "start_time": "2016-12-27T17:30:00.000+01:00", "speaker_names": "Max Bazaliy", "track_id": 318, "room_id": 379, "duration": 1800, "abstract": "This talk will take an in-depth look at the technical capabilities and vulnerabilities used by Pegasus. We will focus on Pegasus’s features and the exploit chain Pegasus used called Trident. Attendees will learn about Pegasus’s use of 0-days, obfuscation, encryption, function hooking, and its ability to go unnoticed. We will present our detailed technical analysis that covers each payload stage of Pegasus including its exploit chain and the various 0-day vulnerabilities that the toolkit was using to jailbreak a device. After this talk attendees will have learned all of the technical details about Pegasus and Trident and how the vulnerabilities we found were patched."}, {"language": "en", "title": "Software Defined Emissions", "event_id": 7904, "start_time": "2016-12-27T20:30:00.000+01:00", "speaker_names": "Felix „tmbinc“ Domke", "track_id": 316, "room_id": 379, "duration": 3600, "abstract": "A technical talk on how to reverse-engineer electronic control units in order to document what was left apparently intentionally undocumented by the vendor – including how Volkswagen tweaked their cycle detection code while already being investigated by the EPA, how different the Volkswagen approach is really to the rest of the industry, and of course some trivia on how the „acoustic function“ got its name."}, {"language": "en", "title": "Syrian Archive", "event_id": 7909, "start_time": "2016-12-28T12:15:00.000+01:00", "speaker_names": "Syrian Archive", "track_id": 316, "room_id": 380, "duration": 1800, "abstract": "Journalists and human rights groups need to find and use verified visual evidence in order to accurately report about what’s happening in conflict zones. In the case of Syria, there are more hours of online footage online than there have been hours of conflict."}, {"language": "de", "title": "Make Wi-Fi fast again", "event_id": 7911, "start_time": "2016-12-27T20:30:00.000+01:00", "speaker_names": "Hendrik Lüth", "track_id": 317, "room_id": 381, "duration": 3600, "abstract": "Mit steigendem Datenaufkommen und einer immer größer werdenden Zahl von Geräten muss auch das WLAN wachsen. Nach \"ur WiFi sucks!!1!\" ist dieser Talk eine kleine Einführung in die Neuerungen, welche mit dem 802.11ac-Standard gekommen sind und gibt eine Erklärung, wie sie funktionieren."}, {"language": "de", "title": "SpiegelMining – Reverse Engineering von Spiegel-Online", "event_id": 7912, "start_time": "2016-12-28T21:45:00.000+01:00", "speaker_names": "David Kriesel", "track_id": 316, "room_id": 380, "duration": 3600, "abstract": "Seit Mitte 2014 hat David fast 100.000 Artikel von Spiegel-Online systematisch gespeichert. Diese Datenmasse wird er in einem bunten Vortrag vorstellen und erforschen."}, {"language": "en", "title": "Formal Verification of Verilog HDL with Yosys-SMTBMC", "event_id": 7922, "start_time": "2016-12-28T17:15:00.000+01:00", "speaker_names": "Clifford", "track_id": 317, "room_id": 382, "duration": 3600, "abstract": "Yosys is a free and open source Verilog synthesis tool and more. It gained prominence last year because of its role as synthesis tool in the Project IceStorm FOSS Verilog-to-bitstream flow for iCE40 FPGAs. This presentation however dives into the Yosys-SMTBMC formal verification flow that can be used for verifying formal properties using bounded model checks and/or temporal induction.\r\n"}, {"language": "en", "title": "The Nibbletronic", "event_id": 7925, "start_time": "2016-12-27T16:00:00.000+01:00", "speaker_names": "ctrapp", "track_id": 317, "room_id": 382, "duration": 1800, "abstract": "The NibbleTronic is a MIDI wind controller that features a novel user interface resulting in a unique tonal range. The standard configuration allows to precisely play a bit more than four full octaves including semitones with only one hand. "}, {"language": "en", "title": "Lasers in the sky (with asteroids)", "event_id": 7927, "start_time": "2016-12-29T22:00:00.000+01:00", "speaker_names": "Peter Buschkamp", "track_id": 323, "room_id": 379, "duration": 1800, "abstract": "At 32C3 we shot lasers into space... now it's lasers in space!\r\nWe look at space- and airborne laser platforms and what practical uses people have come up with (hint: mostly more or less secret communication and military use).  We'll also recap the basic physics and boundaries and check if 'pew pew pew' is really gonna cut it (hint: mostly no). To close, we'll have a look at laser based propulsion for space travel and other speculative applications off the beaten path. "}, {"language": "de", "title": "Check Your Police Record!", "event_id": 7939, "start_time": "2016-12-27T16:00:00.000+01:00", "speaker_names": "RA Ulrich Kerner", "track_id": 316, "room_id": 380, "duration": 1800, "abstract": "Polizeibehörden und Geheimdienste sammeln Daten der Bürger – mehr als je zuvor. Der Bestand an unterschiedlichen Datenbanken ist enorm gewachsen und geradezu unübersichtlich geworden. Aufgrund datenschutzrechtlicher Regelungen gibt es für etliche dieser Datenbanken einen gesetzlichen Auskunftsanspruch des Bürgers."}, {"language": "en", "title": "Interplanetary Colonization", "event_id": 7942, "start_time": "2016-12-29T21:15:00.000+01:00", "speaker_names": "Liz George, Peter Buschkamp", "track_id": 323, "room_id": 379, "duration": 1800, "abstract": "The long term survival of the human species requires that we become an interplanetary species. But we must answer two big questions: where are we going, and how do we get there? We explore what scientists know (and don’t know) about humanity’s potential future homes both inside and outside the solar system, and then we’ll dive into the technological challenges of (and potential solutions for) getting humans to and colonizing a new planet."}, {"language": "en", "title": "Decoding the LoRa PHY", "event_id": 7945, "start_time": "2016-12-29T18:30:00.000+01:00", "speaker_names": "Matt Knight", "track_id": 318, "room_id": 382, "duration": 3600, "abstract": "LoRa is an emerging Low Power Wide Area Network, a new class of wireless technology designed to connect everything from streetlights to intelligent mousetraps.  I will discuss the design and security implications of LPWANs, dive deep into the LoRa PHY, and demonstrate sniffing and injection with an open source LoRa transceiver built on commodity Software Defined Radio tools."}, {"language": "en", "title": "Console Hacking 2016", "event_id": 7946, "start_time": "2016-12-27T23:00:00.000+01:00", "speaker_names": "marcan", "track_id": 318, "room_id": 379, "duration": 3600, "abstract": "Last year, we demonstrated Linux running on the PS4 in a lightning talk - presented on the PS4 itself. But how did we do it? In a departure from previous Console Hacking talks focusing on security, this year we're going to focus on the PS4 hardware, what makes it different from a PC, and how we reverse engineered it enough to get a full-blown Linux distro running on it, complete with 3D acceleration."}, {"language": "en", "title": "Wheel of Fortune", "event_id": 7949, "start_time": "2016-12-28T13:45:00.000+01:00", "speaker_names": "Jos Wetzels, Ali Abbasi", "track_id": 318, "room_id": 382, "duration": 1800, "abstract": "Secure random number generators play a crucial role in the wider security ecosystem. In the absence of a dedicated hardware True Random Number Generator (TRNG), computer systems have to resort to a software (cryptographically secure) Pseudo-Random Number Generator (CSPRNG). Since the (secure) design of a CSPRNG is an involved and complicated effort and since randomness is such a security-critical resource, many operating systems provide a CSPRNG as a core system service and many popular security software products assume their presence. The constraints imposed by the embedded world, however, pose a variety of unique challenges to proper OS (CS)PRNG design and implementation which have historically resulted in security failures. In this talk we will discuss these challenges, how they affect the quality of (CS)PRNGs in embedded operating systems and illustrate our arguments by means of the first public analysis of the OS random number generators of several popular embedded operating systems."}, {"language": "de", "title": "Space making/space shaping", "event_id": 7958, "start_time": "2016-12-27T16:00:00.000+01:00", "speaker_names": "Ulf Treger", "track_id": 314, "room_id": 381, "duration": 1800, "abstract": "What are the politics and aesthetics of mapping? An introduction how cartography shapes cities and landscapes, creates borders and determines the perception of our environment. How an evolving mix of high-resolution satellite imagery, algorithm-based mappings and the huge amount of data of digitized cities will enhance these effects? And in contrast, how can maps be designed, that question the “objectivity” and “correctness” of conventional cartography?\r\n"}, {"language": "de", "title": "Fnord-Jahresrückblick", "event_id": 7960, "start_time": "2016-12-29T00:45:00.000+01:00", "speaker_names": "Fefe, frank", "track_id": 320, "room_id": 379, "duration": 3600, "abstract": "Wenn mal wieder der Zensor pinkeln war, wenn DAMIT ja wohl NIEMAND rechnen konnte, wenn es um demokratisch legitimiertes Baumanagement oder um Stahlbälle geht, dann ist es wieder an der Zeit für eine lockere Abendshow mit den High- und Lowlights des Jahres."}, {"language": "de", "title": "SearchWing - Drones to find refugees in Mediterranean Sea", "event_id": 7963, "start_time": "2016-12-29T16:00:00.000+01:00", "speaker_names": "Steini, Ruben Neugebauer, benthor", "track_id": 317, "room_id": 381, "duration": 3600, "abstract": "Refugees are dying in the Mediterranean Sea. Thousands of them. \r\nWe are building fixed wing drones, autonomously searching for refugee-vessels in a radius of 50km around a base-ship. \r\nThe association \"Seawatch e.V.\" has bought two well equipped Ships to help and rescue those people. But to help them we first have to find them."}, {"language": "en", "title": "Where in the World Is Carmen Sandiego?", "event_id": 7964, "start_time": "2016-12-27T21:45:00.000+01:00", "speaker_names": "Karsten Nohl, nemanja", "track_id": 318, "room_id": 381, "duration": 3600, "abstract": "Travel booking systems are among the oldest global IT infrastructures, and have changed surprisingly little since the 80s. The personal information contained in these systems is hence not well secured by today's standards. This talk shows real-world hacking risks from tracking travelers to stealing flights. "}, {"language": "en", "title": "Geolocation methods in mobile networks", "event_id": 7966, "start_time": "2016-12-27T17:30:00.000+01:00", "speaker_names": "Erik", "track_id": 316, "room_id": 380, "duration": 1800, "abstract": "This talk presents the results of the technical analysis for the German Parliamentary Committee investigating the NSA spying scandal on geolocation methods in mobile networks."}, {"language": "en", "title": "Shut Up and Take My Money!", "event_id": 7969, "start_time": "2016-12-27T16:45:00.000+01:00", "speaker_names": "Vincent Haupert", "track_id": 318, "room_id": 379, "duration": 1800, "abstract": "FinTechs increasingly cut the ground from under long-established banks’ feet. With a \"Mobile First\" strategy, many set their sights on bringing all financial tasks—checking the account balance, making transactions, arranging investments, and ordering an overdraft—on your smartphone. In a business area that was once entirely committed to security, Fintechs make a hip design and outstanding user experience their one and only priority. Even though this strategy is rewarded by rapidly increasing customer numbers, it also reveals a flawed understanding of security. With the example of the pan-European banking startup N26 (formerly Number26), we succeeded independently from the used device to leak customer data, manipulate transactions, and to entirely take over accounts to ultimately issue arbitrary transactions—even without credit."}, {"language": "en", "title": "Making Technology Inclusive Through Papercraft and Sound", "event_id": 7975, "start_time": "2016-12-29T16:00:00.000+01:00", "speaker_names": "bunnie", "track_id": 317, "room_id": 379, "duration": 3600, "abstract": "The participation of women in computer education is low; undergraduate classrooms in Germany were only 10% female in 2000[1]. The picture at the primary school level is fuzzier, as students do not declare majors at that level, but evidence indicates the trend starts from a young age. Can we make computer education more gender-inclusive? Presenting technology in familiar, non-threatening contexts can lead to more balanced gender participation. For example, Chibitronics uses the context of papercraft to present electronics to beginners; the familiarity of papercraft improves the participation of women of all ages in the creation of electronics. Based on these learnings, we have devised the “Love to Code” platform, an open source hardware-to-cloud stack which combines the familiarity of paper craft with a web-based, driver-free embedded firmware development environment based on FSK audio provisioning via a headphone jack. In this talk, we will dive into the novel open source technical contributions of this platform, which includes the audio-based provisioning protocol and the unique rigid-flex design of the circuitry enabling papercraft integration, as well as the multi-threaded client OS and cloud infrastructure required to complete the picture. This combination of new technology with familiar interfaces aims to lower the barrier to computer education, thus making coding a more accessible and inclusive activity."}, {"language": "en", "title": "Surveilling the surveillers", "event_id": 7978, "start_time": "2016-12-30T17:15:00.000+01:00", "speaker_names": "mare", "track_id": 315, "room_id": 380, "duration": 3600, "abstract": "In the last years, technology-savvy artists and technologists have taken over the art world with works addressing current societal and political issues. Their works are located at the intersection between art, technology and activism and are dealing with a variety of problems like free speech, freedom of movement, military and governmental power, corporate and governmental surveillance to name just a few. This talk will present relevant works in this field and will draw connections between critical art and regulatory power, warfare, surveillance, electronic waste, electronic self-defense and the re-appropriation of architectural and technological artifacts in militant ways."}, {"language": "en", "title": "A Data Point Walks Into a Bar", "event_id": 7999, "start_time": "2016-12-27T18:15:00.000+01:00", "speaker_names": "Lisa Charlotte Rost", "track_id": 315, "room_id": 382, "duration": 1800, "abstract": "tl;dr: Mother Teresa said \"If I look at the mass I will never act. If I look at the one, I will.\" I'll present ways that make us act when looking at the mass."}, {"language": "en", "title": "Building Custom Pinball Machines", "event_id": 8012, "start_time": "2016-12-28T17:15:00.000+01:00", "speaker_names": "jab", "track_id": 317, "room_id": 381, "duration": 3600, "abstract": "How to build a pinball machine? We introduce you to all basics and explain the different options for hardware and software. As an example, we show images of our own custom pinball machine."}, {"language": "en", "title": "Untrusting the CPU", "event_id": 8014, "start_time": "2016-12-27T18:15:00.000+01:00", "speaker_names": "jaseg", "track_id": 318, "room_id": 381, "duration": 1800, "abstract": "It is a sad fact of reality that we can no longer trust our CPUs to only run the things we want and to not have exploitable flaws. I will provide an proposal for a system to restore (some) trust in communication secrecy and system security even in this day and age without compromising too much the benefits in usability and speed modern systems provide."}, {"language": "en", "title": "Law Enforcement Are Hacking the Planet", "event_id": 8018, "start_time": "2016-12-27T16:00:00.000+01:00", "speaker_names": "Joseph Cox", "track_id": 316, "room_id": 379, "duration": 1800, "abstract": "In early 2015, the Federal Bureau of Investigation hacked computers in Austria, Denmark, Chile, Colombia, Greece, and likely the United Kingdom and Turkey too. In all, the agency used a Tor Browser exploit to target over 4000 computers spread across the world based on a single, arguably illegal warrant. But this is only one case in the growing trend of law enforcement agencies reaching outside of their own country and hacking criminals suspects abroad, bringing up urgent questions of legality, jurisdiction, and proportionately in the digital age.\r\n"}, {"language": "en", "title": "Lockpicking in the IoT", "event_id": 8019, "start_time": "2016-12-27T21:45:00.000+01:00", "speaker_names": "Ray", "track_id": 317, "room_id": 379, "duration": 3600, "abstract": "\"Smart\" devices using BTLE, a mobile phone and the Internet are becoming more and more popular. We will be using mechanical and electronic hardware attacks, TLS MitM, BTLE sniffing and App decompilation to show why those devices and their manufacturers aren't always that smart after all. And that even AES128 on top of the BTLE layer doesn't have to mean \"unbreakable\". Our main target will be electronic locks, but the methods shown apply to many other smart devices as well..."}, {"language": "de", "title": "Methodisch inkorrekt!", "event_id": 8020, "start_time": "2016-12-30T00:30:00.000+01:00", "speaker_names": "Nicolas Wöhrl, @ReinhardRemfort", "track_id": 320, "room_id": 381, "duration": 3600, "abstract": "Wer hat diese Jungs wieder rein gelassen?! Nicolas Wöhrl und Reinhard Remfort sind eine Gefahr für Leib und Leben. Unter dem Deckmantel der Wissenschaftskommunikation machen sie auf der Bühne alles das, was sie an der Uni nie gewagt hätten. Dazu sprechen sie über aktuelle wissenschaftliche Themen. Laaaangweilig! Wer will denn sowas sehen? Unstrukturiert, abschweifend, hoffnungslos subjektiv und immer garantiert methodisch inkorrekt."}, {"language": "de", "title": "Eine kleine Geschichte der Parlamentsschlägerei", "event_id": 8021, "start_time": "2016-12-29T00:15:00.000+01:00", "speaker_names": "Joachim Schautenbach, Pia Fortunata", "track_id": 320, "room_id": 379, "duration": 1800, "abstract": "Der Vortrag gibt einen Abriss über die Geschichte der Parlamentsschlägerei, ordnet diese politisch und geografisch ein - um dann die verschiedenen Typen und Formen anhand von Videomaterial zu zeigen und gemeinsam zu analysieren.\r\n\r\nDie beiden Vortragenden betreiben seit 2010 gemeinsam das weltweit einzige Fachblog für Parlamentsschlägereien."}, {"language": "en", "title": "Memory Deduplication: The Curse that Keeps on Giving", "event_id": 8022, "start_time": "2016-12-29T12:45:00.000+01:00", "speaker_names": "Ben Gras, Kaveh Razavi, brainsmoke, Antonio Barresi", "track_id": 318, "room_id": 382, "duration": 3600, "abstract": "We are 4 security researchers who have collectively worked on 3 different attack techniques that all (ab)use memory deduplication in one way or another. There is a cross-vm data leak attack, a cross-vm data write attack, and an in-sandbox (MS Edge) Javascript data leak + full memory read/write attack based in MS Edge.\r\n\r\nIn this talk we detail how memory deduplication works and the many different ways it is exploited in our attacks."}, {"language": "de", "title": "Routerzwang und Funkabschottung", "event_id": 8024, "start_time": "2016-12-27T17:30:00.000+01:00", "speaker_names": "Max Mehl", "track_id": 316, "room_id": 381, "duration": 1800, "abstract": "Nach drei Jahren wurde endlich die nutzerunfreundliche Praktik des Routerzwangs (\"Compulsory Routers\") gesetzlich für unzulässig erklärt, und aktuell treibt uns die EU-Funkabschottung (\"Radio Lockdown Directive\") um. Um was geht es dabei? Und was können wir daraus für andere Fälle lernen? \r\n\r\nIm Vortrag wird klar werden, warum politischer Aktivismus so wichtig ist und dass er eigentlich gar nicht so schwer ist, wenn man ein paar Dinge beachtet."}, {"language": "en", "title": "A Story of Discrimination and Unfairness", "event_id": 8026, "start_time": "2016-12-27T16:45:00.000+01:00", "speaker_names": "Aylin Caliskan", "track_id": 314, "room_id": 380, "duration": 1800, "abstract": "Artificial intelligence and machine learning are in a period of astounding growth. However, there are concerns that these technologies may be used, either with or without intention, to perpetuate the prejudice and unfairness that unfortunately characterizes many human institutions. We show for the first time that human-like semantic biases result from the application of standard machine learning to ordinary language—the same sort of language humans are exposed to every day. We replicate a spectrum of standard human biases as exposed by the Implicit Association Test and other well-known psychological studies. We replicate these using a widely used, purely statistical machine-learning model—namely, the GloVe word embedding—trained on a corpus of text from the Web. Our results indicate that language itself contains recoverable and accurate imprints of our historic biases, whether these are morally neutral as towards insects or flowers, problematic as towards race or gender, or even simply veridical, reflecting the status quo for the distribution of gender with respect to careers or first names. These regularities are captured by machine learning along with the rest of semantics. In addition to our empirical findings concerning language, we also contribute new methods for evaluating bias in text, the Word Embedding Association Test (WEAT) and the Word Embedding Factual Association Test (WEFAT). Our results have implications not only for AI and machine learning, but also for the fields of psychology, sociology, and human ethics, since they raise the possibility that mere exposure to everyday language can account for the biases we replicate here."}, {"language": "en", "title": "Intercoms Hacking", "event_id": 8027, "start_time": "2016-12-28T21:45:00.000+01:00", "speaker_names": "Sebastien Dudek", "track_id": 318, "room_id": 381, "duration": 3600, "abstract": "<p>To break into a building, several methods have already been discussed, such as trying to find the code\r\npaths of a digicode, clone RFID cards, use some social engineering attacks, or the use of archaic methods\r\nlike lockpicking a door lock or breaking a window.</p>\r\n<p>New methods are now possible with recent intercoms.\r\nIndeed, these intercoms are used to call the tenants to access the building. But little study has been\r\nperformed on how these boxes communicate to request and grant access to the building.</p>\r\n<p>In the past, they were connected with wires directly to apartments. Now, these are more practical and\r\nallow residents to open doors not only from their classic door phone, but to forward calls to their home\r\nor mobile phone. Private houses are now equipped with these new devices and its common to find these\r\n“connected” intercoms on recent and renovated buildings.</p>\r\n<p>In this short paper we introduce the Intercoms and focus on one particular device that is commonly\r\ninstalled in buildings today. Then we present our analysis on an interesting attack vector, which already\r\nhas its own history. After this analysis, we present our environment to test the intercoms, and show some\r\npractical attacks that could be performed on these devices. During this talks, the evolution of our mobile lab and some advances on the 3G intercoms, and M2M intercoms attacks will be also presented.</p>"}, {"language": "en", "title": "The Ultimate Game Boy Talk", "event_id": 8029, "start_time": "2016-12-30T16:00:00.000+01:00", "speaker_names": "Michael Steil", "track_id": 317, "room_id": 379, "duration": 3600, "abstract": "The 8-bit Game Boy was sold between 1989 and 2003, but its architecture more closely resembles machines from the early 1980s, like the Commodore 64 or the NES. This talk attempts to communicate \"everything about the Game Boy\" to the listener, including its internals and quirks, as well as the tricks that have been used by games and modern demos, reviving once more the spirit of times when programmers counted clock cycles and hardware limitations were seen as a challenge."}, {"language": "en", "title": "No USB? No problem.", "event_id": 8031, "start_time": "2016-12-28T16:00:00.000+01:00", "speaker_names": "Xobs", "track_id": 317, "room_id": 381, "duration": 3600, "abstract": "How to get USB running on an ARM microcontroller that has no built in USB hardware.  We'll cover electrical requirements, pin assignments, and microcontroller considerations, then move all the way up the stack to creating a bidirectional USB HID communications layer entirely in software."}, {"language": "en", "title": "What's It Doing Now?", "event_id": 8033, "start_time": "2016-12-27T18:15:00.000+01:00", "speaker_names": "Bernd Sieker", "track_id": 314, "room_id": 379, "duration": 1800, "abstract": "Legend has it that most airline pilots will at one time have uttered the sentence \"What's it Doing now?\", whenever the autopilot or one of its related systems did something unexpected. I will be exploring some high-profile accidents in which wrong expectations of automation behaviour contributed to the outcome."}, {"language": "en", "title": "Build your own NSA", "event_id": 8034, "start_time": "2016-12-28T20:30:00.000+01:00", "speaker_names": "Andreas Dewes, @sveckert", "track_id": 318, "room_id": 380, "duration": 3600, "abstract": "When thinking about surveillance, everyone worries about government agencies like the NSA and big corporations like Google and Facebook. But actually there are hundreds of companies that have also discovered data collection as a revenue source.  We decided to do an experiment: Using simple social engineering techniques, we tried to get the most personal you may have in your procession."}, {"language": "de", "title": "Die Sprache der Populisten", "event_id": 8037, "start_time": "2016-12-28T16:00:00.000+01:00", "speaker_names": "Kai Biermann, Martin Haase/maha", "track_id": 316, "room_id": 379, "duration": 3600, "abstract": "Mit dem Erstarken der Rechtspopulisten (nicht nur in Deutschland) werden populistische Positionen immer häufiger hingenommen, obwohl es sich dabei um vermeintliche \"Gewissenheiten\" handelt, die bei näherer Betrachtung inakzeptabel sind. Solche Positionen beruhen nicht auf einer nachvollziehbaren Argumentation, sondern auf sprachlich-rhetorischen Tricks, die im Grunde leicht zu durchschauen sind, denen jedoch immer mehr Menschen auf den Leim gehen. Dieser Vortrag soll zeigen, welche Tricks das sind und wie Populisten demaskiert werden können. Dabei wird deutlich werden, dass nicht nur eine Partei für populistische Parolen anfällig ist."}, {"language": "en", "title": "What We Can Learn about Creativity from 3D Printing", "event_id": 8039, "start_time": "2016-12-29T22:00:00.000+01:00", "speaker_names": "Sascha Friesike", "track_id": 314, "room_id": 380, "duration": 1800, "abstract": "For the past three years we studied the world’s largest 3D printing community “Thingiverse”. We explored the remix-relationships—accessible due the community’s use of open licenses—of more than 200.000 individual designs, tracked an entire week’s new designs for half a year, interviewed more than 80 creators and surveyed over 200 more. This allowed us to develop a deep understanding of the creative processes that take place on the platform.\r\nIn this talk we would like to present our findings. This is of interest to people who care about 3D printing as we can give sort of a behind the scenes view on how ideas come to life here. But it is also interesting to people that care about creativity in general. As what we have found has merit outside of 3D printing, too. In this talk we would like to cover the following: (1) Introduce our research setting and explain why it is useful to study this, (2) provide a consolidated overview on our most interesting findings, and (3) give real life examples for how these findings are transferable to other settings.\r\nWe have presented primary results of the studies at various academic conferences and have a comprehensive paper on the project currently under revision at the Journal of Information Technology (see attached file). We are a group of three university professors and a Ph.D. student. We work on the intersection of information systems, innovation management, product development, and creativity. We believe that many of the people we studied either attend 33C3 or watch talks online and we therefore think that our results would be of interest to this community. Further, we feel that a well structured talk is better and more entertaining than mailing around our academic journal publications to those who are interested. And lastly, we are eager to receive feedback from a more hands-on audience (than what we deal with at academic conferences). It would be especially useful for us to hear of new developments, discuss ideas for follow-up research projects, and get access to creators that would like to work with us in the future."}, {"language": "de", "title": "Privatisierung der Rechtsdurchsetzung", "event_id": 8040, "start_time": "2016-12-30T14:30:00.000+01:00", "speaker_names": "Markus Beckedahl", "track_id": 316, "room_id": 380, "duration": 1800, "abstract": "2016 drehte der Anti-Terror-Kampf in der EU auf. Nicht nur im Rahmen der Anti-Terror-Richtlinie wurde über neue Wege diskutiert, wie man das Netz verstärkt unter Kontrolle bringen kann."}, {"language": "en", "title": "Code BROWN in the Air", "event_id": 8042, "start_time": "2016-12-28T23:00:00.000+01:00", "speaker_names": "miaoski", "track_id": 318, "room_id": 382, "duration": 3600, "abstract": "The talk is about the paging system, an old technology in the 90's, used in healthcare, ICS and government, a systematic review of security impacts that it brought to us in the age of SDR, covering the United States, Canada, England and Japan.  By sniffing known pager frequencies in the general vicinity of hospitals, factories and public facilities with a $20 DVB-T, we discovered that not only is pager technology alive and kicking, but much of the traffic is not encrypted, resulting in violation of privacy laws and more importantly, leaks of sensitive information.  The talk is not about the protocol nor the hardware device."}, {"language": "en", "title": "What could possibly go wrong with <insert x86 instruction here>?", "event_id": 8044, "start_time": "2016-12-27T11:30:00.000+01:00", "speaker_names": "Clémentine Maurice, Moritz Lipp", "track_id": 318, "room_id": 381, "duration": 3600, "abstract": "Hardware is often considered as an abstract layer that behaves correctly, just executing instructions and outputting a result. However, the internal state of the hardware leaks information about the programs that are executing. In this talk, we focus on how to extract information from the execution of simple x86 instructions that do not require any privileges. Beyond classical cache-based side-channel attacks, we demonstrate how to perform cache attacks without a single memory access, as well as how to bypass kernel ASLR. This talk does not require any knowledge about assembly. We promise."}, {"language": "de", "title": "0en & 1en auf dem Acker", "event_id": 8045, "start_time": "2016-12-27T17:30:00.000+01:00", "speaker_names": "Fritz Herzrasen, Lisa Tschorn", "track_id": 314, "room_id": 382, "duration": 1800, "abstract": "Die Dynamik der globalen Agrarmärkte hat sich in den letzten Jahren verstärkt und birgt neue Herausforderungen für die Landwirte. Hoffnungsträger sind ähnlich wie in anderen Branchen auch Sensor- & Datenverarbeitungstechnik sowie das Internet: Produktionsprozesse steuern sich selbst, Anhänger werden halbautomatisch mittels Bilderkennung beladen, Maschinen kommunizieren mittels Maschinen und Fahrzeuge steuern sich weitestgehend schon jetzt autonom.\r\n"}, {"language": "en", "title": "Dissecting HDMI", "event_id": 8057, "start_time": "2016-12-29T17:15:00.000+01:00", "speaker_names": "Tim 'mithro' Ansell", "track_id": 317, "room_id": 379, "duration": 3600, "abstract": "Ever wondered what is actually happening when a speaker can't get their laptop to project? While developing the FPGA-based <a href=\"https://hdmi2usb.tv\">HDMI2USB.tv open hardware for recording conferences</a>, we discovered just how convoluted the HDMI protocol can be. Come hear all the horrible details!"}, {"language": "en", "title": "You can -j REJECT but you can not hide: Global scanning of the IPv6 Internet", "event_id": 8061, "start_time": "2016-12-27T23:00:00.000+01:00", "speaker_names": "Tobias Fiebig", "track_id": 318, "room_id": 380, "duration": 3600, "abstract": "In this talk we will explore and present various IPv6 scanning techniques that allow attackers to peek into IPv6 networks. With the already known difference between IPv4 and IPv6 firewalling (the latter is worse... ) we then demonstrate how these techniques can be combined and used to obtain a large-scale view on the state of IPv6 in infrastructures and data centers. To give the whole issue a somewhat more fun dimension, we will also look at some (security) sensitive applications of this technique. Complimentary code-snippets will be provided."}, {"language": "en", "title": "A look into the Mobile Messaging Black Box", "event_id": 8062, "start_time": "2016-12-28T11:30:00.000+01:00", "speaker_names": "Roland Schilling, Frieder Steinmetz", "track_id": 318, "room_id": 381, "duration": 3600, "abstract": "Most of us use mobile messaging every day. We use certain apps that we chose for a number of factors, like our friends using it, good press, privacy promises, or simply their feature sets. This talk aims to enable more of us to reason about the privacy and security of messaging apps. We will try to present simple analogies translating abstract security and privacy expectations into concrete feature sets. We will illustrate these features using the two well-known messaging apps Signal and Threema. Our analysis of both protocols is based on the open-source code-base of Signal and our own reverse-engineered re-implementation of the Threema protocol that we will release during the talk."}, {"language": "en", "title": "The Transhumanist Paradox", "event_id": 8064, "start_time": "2016-12-30T13:45:00.000+01:00", "speaker_names": "Xavier Flory", "track_id": 316, "room_id": 382, "duration": 1800, "abstract": "How does a pluralist society – a society built to accommodate our irreconcilable differences – make a choice about the technological future of mankind? How can a liberal state dedicated to upholding individual liberty interfere in technological progress, and why should it? "}, {"language": "en", "title": "State of Internet Censorship 2016", "event_id": 8068, "start_time": "2016-12-28T20:30:00.000+01:00", "speaker_names": "Will Scott", "track_id": 316, "room_id": 381, "duration": 3600, "abstract": "2016 has been marked by major shifts in political policy towards the Internet in Turkey and Thailand, a renegotiation of the responsibilities of content platforms in the west, and a continued struggle for control over the Internet around the world. Turbulent times, indeed. In this session, we'll survey what's changed in Internet surveillance and censorship in the last year, and provide context for the major changes affecting the net today."}, {"language": "en", "title": "Tapping into the core", "event_id": 8069, "start_time": "2016-12-28T13:00:00.000+01:00", "speaker_names": "mgoryachy, Mark Ermolov", "track_id": 318, "room_id": 382, "duration": 1800, "abstract": "Engaging universally available deep debug functionality of modern\r\nIntel cores, with zero software or hardware modifications\r\nrequired on the target side."}, {"language": "en", "title": "Liberté, Égalité, Fraternité... and privacy ?!", "event_id": 8072, "start_time": "2016-12-29T14:00:00.000+01:00", "speaker_names": "Agnes, Christopher Talib", "track_id": 316, "room_id": 382, "duration": 3600, "abstract": "France is under a state of emergency since November 2015. Several laws and a more intrusive surveillance framework, infringing rights and freedoms, have been  adopted these recent years in the name of the fight against terrorism. Privacy, freedom of expression... these words could soon disappear from French vocabulary as the number of measures increases as the same time than their intensity. We will show how it happened and what are our actions to try to defend the rights of all to privacy and freedom of speech."}, {"language": "en", "title": "Recount 2016: An Uninvited Security Audit of the U.S. Presidential Election", "event_id": 8074, "start_time": "2016-12-28T14:30:00.000+01:00", "speaker_names": "Matt  Bernhard, J. Alex Halderman", "track_id": 318, "room_id": 379, "duration": 3600, "abstract": "The 2016 U.S. presidential election was preceded by unprecedented cyberattacks and produced a result that surprised many people in the U.S. and abroad.  Was it hacked?  To find out, we teamed up with scientists and lawyers from around the country&mdash;and a presidential candidate&mdash;to initiate the first presidential election recounts motivated primarily by e-voting security concerns.  In this talk, we will explain how the recounts took place, what we learned about the integrity of the election, and what needs to change to ensure that future U.S. elections are secure.\r\n"}, {"language": "en", "title": "Make the Internet Neutral Again ", "event_id": 8076, "start_time": "2016-12-27T18:15:00.000+01:00", "speaker_names": "Thomas Lohninger, Christopher Talib", "track_id": 316, "room_id": 380, "duration": 1800, "abstract": "After three years the EU has for the first time new Net Neutrality rules. What do they mean in practice? Which commercial practices by ISPs are allowed and which have to be punished by the telecom regulator. We give an overview about three years of campaign and where we go from here. "}, {"language": "en", "title": "How physicists analyze massive data: LHC + brain + ROOT = Higgs", "event_id": 8083, "start_time": "2016-12-28T12:15:00.000+01:00", "speaker_names": "Axel", "track_id": 314, "room_id": 379, "duration": 1800, "abstract": "Physicists are not computer scientists. But at CERN and worldwide, they need to analyze petabytes of data, efficiently. Since more than 20 years now, ROOT helps them with interactive development of analysis algorithms (in the context of the experiments' multi-gigabyte software libraries), serialization of virtually any C++ object, fast statistical and general math tools, and high quality graphics for publications. I.e. ROOT helps physicists transform data into knowledge.\r\n\r\nThe presentation will introduce the life of data, the role of computing for physicists and how physicists analyze data with ROOT. It will sketch out how some of us foresee the development of data analysis given that the rest of the world all of a sudden also has big data tools: where they fit, where they don't, and what's missing.\r\n"}, {"language": "en", "title": "Lightning Talks Day 2", "event_id": 8087, "start_time": "2016-12-28T12:45:00.000+01:00", "speaker_names": "gedsic", "track_id": 319, "room_id": 381, "duration": 8100, "abstract": "Lightning Talks are short lectures (almost) any congress participant may give! Bring your infectious enthusiasm to an audience with a short attention span! Discuss a program, system or technique! Pitch your projects and ideas or try to rally a crew of people to your party or assembly! Whatever you bring, make it quick! "}, {"language": "en", "title": "Lightning Talks Day 3", "event_id": 8088, "start_time": "2016-12-29T12:45:00.000+01:00", "speaker_names": "gedsic", "track_id": 319, "room_id": 381, "duration": 8100, "abstract": "Lightning Talks are short lectures (almost) any congress participant may give! Bring your infectious enthusiasm to an audience with a short attention span! Discuss a program, system or technique! Pitch your projects and ideas or try to rally a crew of people to your party or assembly! Whatever you bring, make it quick! "}, {"language": "en", "title": "Lightning Talks Day 4", "event_id": 8089, "start_time": "2016-12-30T12:45:00.000+01:00", "speaker_names": "gedsic", "track_id": 319, "room_id": 381, "duration": 8100, "abstract": "Lightning Talks are short lectures (almost) any congress participant may give! Bring your infectious enthusiasm to an audience with a short attention span! Discuss a program, system or technique! Pitch your projects and ideas or try to rally a crew of people to your party or assembly! Whatever you bring, make it quick! "}, {"language": "de", "title": "Datenschutzgrundverordnung: Rechte für Menschen, Pflichten für Firmen & Chancen für uns", "event_id": 8092, "start_time": "2016-12-30T13:45:00.000+01:00", "speaker_names": "derPUPE", "track_id": 316, "room_id": 379, "duration": 1800, "abstract": "Ziel des Vortrages ist es, einen Überblick über die neuen aus der Datenschutzgrundverordnung entstehenden Rechte von Betroffenen (also Du mein*e junge*r Jedi) zu geben und dabei aufzuzeigen, an welchen Stellen Musik für uns drin sein kann."}, {"language": "en", "title": "Visiting The Bear Den", "event_id": 8094, "start_time": "2016-12-27T23:00:00.000+01:00", "speaker_names": "Jessy Campos", "track_id": 318, "room_id": 382, "duration": 3600, "abstract": "Sednit, a.k.a Fancy Bear/APT28/Sofacy, is a group of attackers\r\noperating since at least 2004 and whose main objective is to steal\r\nconfidential information from specific targets. Over the past two years,\r\nthis group's activity increased significantly, in particular with numerous attacks against foreign affairs ministries and embassies all over the world. They are supposedly behind the DNC hack, and the WADA hack, which happened earlier this year. This talk presents the results of a two-year hunt after Sednit, during which we dug up and analyzed many of their software.\r\n\r\n"}, {"language": "en", "title": "radare demystified", "event_id": 8095, "start_time": "2016-12-29T11:30:00.000+01:00", "speaker_names": "pancake", "track_id": 318, "room_id": 380, "duration": 3600, "abstract": "radare is a libre framework and a set of tools to ease several tasks related to reverse engineering, exploiting, forensics, binary patching, .. this year, the project gets 10 year old.\r\n\r\nIn the process, the design evolved and several new functionalities has appeared, defining better development rules, improving code reviews and introducing RDD and fuzzing as part of the development process. Constant refactoring, writing usage examples and documentation and giving talks, to enlarge the community has been key elements to reach the great user base and health the project lives nowadays.\r\n\r\nThis year, in order to celebrate the 10th anniversary, the author organized the first r2con, a congress around the tool that aims to be an excuse for sharing knowledge, tools, scripts about what different parties and people is doing with it.\r\n\r\nThe congress was pretty successful and allowed to meet developers, users and other interested parties for learning more about the future of the tool and understanding its capabilities."}, {"language": "de", "title": "Technologien für und wider Digitale Souveränität", "event_id": 8097, "start_time": "2016-12-29T17:15:00.000+01:00", "speaker_names": "ruedi", "track_id": 316, "room_id": 380, "duration": 3600, "abstract": "''Technologien für und wider Digitale Souveränität''\r\n\r\nDie weltweite Vernetzung ist die tiefgreifendste Veränderung seit der\r\nindustriellen Revolution.  In einer Zeit der maßlose Massenüberwachung scheint die Digitale Souveränität den Einsatz privatsphärenfreundlicher Technologien als ein unverzichtbarer Bestandteil von gesellschaftlichen Lösungsversuchen zwingend zu erfordern.\r\n\r\nIn unserem Beitrag möchten wir hackerrelvante Teilaspekte und Verfahren aus einer Studie für das Bundesministerium für Justiz und Verbraucherschutz vorstellen. Unter anderem sind hier kryptographische Protokolle (z. B.  Blinde Signaturen, Zero-Knowlege Protokolle) und Methoden zur statistischen Auswertung von vertraulichen Daten  (z.B. K-Anonymität, Differentielle Vertraulichkeit) zu nennen.\r\n"}, {"language": "en", "title": "How do we know our PRNGs work properly?", "event_id": 8099, "start_time": "2016-12-29T11:30:00.000+01:00", "speaker_names": "Vladimir Klebanov, Felix Dörre", "track_id": 318, "room_id": 381, "duration": 3600, "abstract": "Pseudo-random number generators (PRNGs) are critical pieces of security\r\ninfrastructure. Yet, PRNGs are surprisingly difficult to design,\r\nimplement, and debug. The PRNG vulnerability that we recently found in\r\nGnuPG/Libgcrypt (CVE-2016-6313) survived 18 years of service and several\r\nexpert audits. In this presentation, we not only describe the details of\r\nthe flaw but, based on our research, explain why the current state of\r\nPRNG implementation and quality assurance downright provokes incidents.\r\nWe also present a PRNG analysis method that we developed and give\r\nspecific recommendations to implementors of software producing or\r\nconsuming pseudo-random numbers to ensure correctness.\r\n"}, {"language": "en", "title": "Edible Soft Robotics", "event_id": 8113, "start_time": "2016-12-29T22:45:00.000+01:00", "speaker_names": "Kari Love", "track_id": 317, "room_id": 381, "duration": 1800, "abstract": "As a soft roboticist I am constantly searching for inspiration for novel soft actuators, and as a home cook and artist I consider eating an object to be a high-level form of interactivity. Having noted the similarities between cast silicone and gummi candies it was natural to combine these interests. I will share my experiments in assessing different candies for their engineering potential, and show my work-in-progress for sweet pneumatic soft robots."}, {"language": "en", "title": "Million Dollar Dissidents and the Rest of Us", "event_id": 8115, "start_time": "2016-12-29T11:30:00.000+01:00", "speaker_names": "wrm, John Scott-Railton", "track_id": 316, "room_id": 379, "duration": 3600, "abstract": "In August 2016, Apple issued updates to iOS and macOS that patched three zero-day vulnerabilities that were being exploited in the wild to remotely install persistent malcode on a target’s device if they tapped on a specially crafted link. We linked the vulnerabilities and malcode to US-owned, Israel-based NSO Group, a government-exclusive surveillance vendor described by one of its founders as “a complete ghost”."}, {"language": "de", "title": "Nicht öffentlich.", "event_id": 8116, "start_time": "2016-12-28T00:15:00.000+01:00", "speaker_names": "anna, Kai Biermann, Felix Betzin, Elisabeth Pleß, Johannes Wolf", "track_id": 320, "room_id": 379, "duration": 3600, "abstract": "Der NSA-Untersuchungsausschuss im Bundestag soll aufklären, was die NSA in Deutschland tut und wie deutsche Geheimdienste in diese Aktivitäten verwickelt sind. Fast wie in einer Gerichtsverhandlung – doch es gibt eine Besonderheit: Der Zeuge ist der BND, ein Geheimdienst. Und der tut alles dafür, nichts zu verraten.\r\n\r\n"}, {"language": "en", "title": "Germany after Snowden: Is Data-Protection-Friendly Germany fighting State Surveillance?", "event_id": 8117, "start_time": "2016-12-28T17:15:00.000+01:00", "speaker_names": "anna, Andre Meister", "track_id": 316, "room_id": 379, "duration": 3600, "abstract": "Germany boasts an international reputation for having strong data protection in popular demand and enshrined in law. In this line, it features the only parliamentary inquiry committee investigating the Snowden revelations on ubiquitous mass surveillance in the world. But what are actual results of parliamentary, journalistic and public engagement?"}, {"language": "en", "title": "How Do I Crack Satellite and Cable Pay TV?", "event_id": 8127, "start_time": "2016-12-27T12:45:00.000+01:00", "speaker_names": "Chris Gerlinsky", "track_id": 318, "room_id": 380, "duration": 3600, "abstract": "Follow the steps taken to crack a conditional access and scrambling system used in millions of TV set-top-boxes across North America. From circuit board to chemical decapsulation, optical ROM extraction, glitching, and reverse engineering custom hardware cryptographic features. This talk describes the techniques used to breach the security of satellite and cable TV systems that have remained secure after 15+ years in use."}, {"language": "en", "title": "Dieselgate – A year later", "event_id": 8131, "start_time": "2016-12-27T19:00:00.000+01:00", "speaker_names": "Daniel Lange (DLange)", "track_id": 316, "room_id": 379, "duration": 1800, "abstract": "At 32C3 we gave an overview on the organizational and technical aspects of Dieselgate that had just broken public three months before. In the last year we have learned a lot and spoken to hundreds of people. Daniel gives an update on what is known and what is still to be revealed."}, {"language": "en", "title": "Saving the World with (Vegan) Science", "event_id": 8135, "start_time": "2016-12-29T21:15:00.000+01:00", "speaker_names": "Benjamin Rupert", "track_id": 314, "room_id": 381, "duration": 1800, "abstract": "Describing the science behind new high tech vegan foods which will replace animal agriculture. I will also discuss the potential impact to lessen the severity of climate change and give an update on the Real Vegan Cheese biohacker project."}, {"language": "en", "title": "Stopping law enforcement hacking", "event_id": 8136, "start_time": "2016-12-28T18:30:00.000+01:00", "speaker_names": "Christopher Soghoian", "track_id": 316, "room_id": 379, "duration": 3600, "abstract": "We didn't win the second crypto wars. Governments merely made a strategic retreat and they'll be back. Although they will likely give up on trying to regulate or prohibit encryption, we should expect that malware and law enforcement hacking will play a starring role in the next battle in the crypto wars. In a world where encryption is increasingly the norm, the cops aren't going to give up and go home. No, they'll target our scarily insecure mobile devices and computers. How did we get here, what's going on, and what can we do to stop it? Come to this talk to find out."}, {"language": "de", "title": "Hochsicherheits-Generalschlüssel Marke Eigenbau", "event_id": 8139, "start_time": "2016-12-29T18:30:00.000+01:00", "speaker_names": "Michael Weiner, RFguy", "track_id": 317, "room_id": 381, "duration": 3600, "abstract": "Die Verfügbarkeit preiswerter Maschinentechnik und Open Source CAD-Software hat den Aufwand des Herstellens eigener mechanischer Schlüssel signifikant abgesenkt, die wir noch vor zehn Jahren als „sicher“ bezeichnet haben.\r\nKlassische Zylinderschlösser sind in der Vergangenheit bereits ausführlich analysiert worden, doch wie sieht die Situation bei anspruchsvolleren mechanischen Schließsystemen aus?\r\nWir zeigen, wie man den Generalschlüssel einer hoch präzisen, hochpreisigen Schließanlage ermittelt. Weiterhin präsentieren wir unseren Workflow der Software und Mechanik, mit dem man Rohlinge und Schlüssel eines Hochsicherheitssystem mit einer „Low Cost“ CNC-Fräse herstellen kann. Im Gegensatz zum 3D-Drucken bietet uns dies eine deutlich höhere Präzision und mechanische Stabilität - und das für unter 2 Euro pro Schlüssel."}, {"language": "en", "title": "Virtual Secure Boot", "event_id": 8142, "start_time": "2016-12-30T16:00:00.000+01:00", "speaker_names": "Gerd Hoffmann", "track_id": 318, "room_id": 382, "duration": 3600, "abstract": "Over the last two years secure boot support for virtual machines was added to qemu, kvm (linux kernel) and ovmf (edk2/tianocore).  This talk covers the implementation details and the issues we had to deal with along the way."}, {"language": "en", "title": "Woolim – Lifting the Fog on DPRK’s Latest Tablet PC", "event_id": 8143, "start_time": "2016-12-27T23:00:00.000+01:00", "speaker_names": "Florian Grunow, Niklaus Schiess, Manuel Lubetzki", "track_id": 316, "room_id": 381, "duration": 3600, "abstract": "Last year we have been talking about DPRK’s operating system Red Star OS and its surveillance features. We have identified a watermarking mechanism and gave an insight on the internals of the operating system itself. This year we will be talking about one of DPRK’s Tablet PCs, called Woolim."}, {"language": "en", "title": "Dissecting modern (3G/4G) cellular modems", "event_id": 8151, "start_time": "2016-12-29T14:00:00.000+01:00", "speaker_names": "LaForge, holger", "track_id": 318, "room_id": 380, "duration": 3600, "abstract": "Let's have a detailed look at some modern 3G/4G cellular modems and see what we can find out about their internals using undocumented debug interfaces and software or hardware based hacking techniques."}, {"language": "en", "title": "A New Dark Age", "event_id": 8163, "start_time": "2016-12-29T17:15:00.000+01:00", "speaker_names": "James Bridle", "track_id": 315, "room_id": 381, "duration": 3600, "abstract": "James Bridle is a British writer and artist living in Greece. His work explores the impact of technology on society, law, geography, politics, and culture. His Drone Shadow installations have appeared on city streets worldwide, he has mapped deportation centres with CGI, designed new kinds of citizenship based on online behaviour. and used neural networks and satellite images to predict election results. A New Dark Age is an exploration of what we can no longer know about the world, and what we can do about it.\r\n\r\n"}, {"language": "en", "title": "Everything you always wanted to know about Certificate Transparency", "event_id": 8167, "start_time": "2016-12-27T11:30:00.000+01:00", "speaker_names": "Martin Schmiedecker", "track_id": 318, "room_id": 382, "duration": 3600, "abstract": "Certificate transparency - what is it, and what can be done with it?"}, {"language": "en", "title": "In Search of Evidence-Based IT-Security", "event_id": 8169, "start_time": "2016-12-28T13:45:00.000+01:00", "speaker_names": "hanno", "track_id": 314, "room_id": 380, "duration": 1800, "abstract": "Applied IT security is largely a science-free field. The IT-Security industry is selling a range of products with often very questionable and sometimes outright ridiculous claims. Yet it's widely accepted practice among users and companies that protection with security appliances, antivirus products and firewalls is a necessity. There are no rigorous scientific studies that try to evaluate the effectiveness of most security products or strategies. Evidence-based IT security could provide a way out of the security nihilism that's often dominating the debate – however it doesn't exist yet."}, {"language": "en", "title": "The Economic Consequences of Internet Censorship", "event_id": 8170, "start_time": "2016-12-30T11:30:00.000+01:00", "speaker_names": "Toni", "track_id": 316, "room_id": 379, "duration": 1800, "abstract": "Internet censorship today is widespread, both by governments and by private entities. Much of the discussion so far has focused on political and social effects of this censorship. However, censorship also has a clear effect on the economic structure of society that has not been explored. When censorship increases the cost of information, it also increases the cost of doing business as a whole. At the same time, however, censorship can also serve as protectionism. How large and pervasive the impact on an economic system is, is difficult to gauge. Even more so, getting reliable information about censorship and its economic effects is a real challenge. This talk seeking to establish a link between censorship and economic performance and is based on my PhD project in Economics at the University of Duisburg-Essen."}, {"language": "de", "title": "Haft für Whistleblower?", "event_id": 8181, "start_time": "2016-12-28T14:30:00.000+01:00", "speaker_names": "RA Ulrich Kerner", "track_id": 316, "room_id": 380, "duration": 1800, "abstract": "Der neue Straftatbestand der Datenhehlerei gem. § 202d StGB kriminalisiert Whistleblower und droht mit Haftstrafe bis zu drei Jahren oder Geldstrafe. Das schwächt die Zivilgesellschaft und verhindert wichtige demokratische Aufklärungsprozesse."}, {"language": "en", "title": "The 12 Networking Truths", "event_id": 8191, "start_time": "2016-12-29T22:45:00.000+01:00", "speaker_names": "Jonas Lund", "track_id": 315, "room_id": 382, "duration": 1800, "abstract": "In *The 12 Networking Truths* Swedish artist Jonas Lund will discuss how he has attempted to subvert the contemporary art world system by using different types of exploits to gain an upper hand against the competition. \r\n\r\nFrom designing an algorithm for art production to data mining art world personalities, the artist will describe how he has incorporated a classic programming mindset in an otherwise logic-free environment. \r\n\r\nThe 12 Networking Truths refers to RFC 1925 - The Twelve Networking Truths, a memo posted on the 1st of April 1996, positioned as revealing the fundamental truths underlying all network protocol designs. The truths include statements such as ‘It Has To Work.’ and ‘Good, Fast, Cheap: Pick any two (you can’t have all three).’. This memo will be the underlying story line throughout the talk, as each truths has a corresponding position within the artist’s artistic practice. \r\n"}, {"language": "en", "title": "Predicting and Abusing WPA2/802.11 Group Keys", "event_id": 8195, "start_time": "2016-12-27T14:00:00.000+01:00", "speaker_names": "Mathy Vanhoef", "track_id": 318, "room_id": 382, "duration": 3600, "abstract": "We analyze the generation and management of WPA2 group keys. These keys protect broadcast and multicast Wi-Fi traffic. We discovered several issues and illustrate their importance by decrypting all group (and unicast) traffic of a typical Wi-Fi network."}, {"language": "en", "title": "Ethics in the data society", "event_id": 8214, "start_time": "2016-12-29T23:30:00.000+01:00", "speaker_names": "mayameme", "track_id": 316, "room_id": 382, "duration": 1800, "abstract": "This talk presents the idea that ethics as logic that can be programmed into machines doesn't seem to work; perhaps, ethics is something else. This talk is about what that something else may be - power. (This talk is not about the Trolley Problem! But it will mention why it shouldn't apply to the driverless car)"}, {"language": "en", "title": "Genetic Codes and what they tell us – and everyone else", "event_id": 8221, "start_time": "2016-12-30T13:00:00.000+01:00", "speaker_names": "_Adora_Belle_", "track_id": 314, "room_id": 379, "duration": 1800, "abstract": "The genome – the final frontier – or just a complex mess of letters? Somewhere in there, our eye or skin color is hidden. But also, diseases can be diagnosed or predicted by analyzing the genome. More and more research is committed to finding clues for diseases in our genes. The opportunity is clear: If I know about a disease I might get ahead of time, I could possibly intervene before it starts. Yet: How accurate are these predictions and how meaningful are they? And more importantly: What happens to my genetic data once it has been decoded?"}, {"language": "en", "title": "Beyond Virtual and Augmented Reality", "event_id": 8225, "start_time": "2016-12-30T12:15:00.000+01:00", "speaker_names": "Kai Kunze", "track_id": 314, "room_id": 380, "duration": 1800, "abstract": "With recent development in capture technology, preserving one's’ daily experiences and one's’ knowledge becomes richer and more comprehensive. Furthermore, new recording technologies beyond simple audio/video recordings become available: 360° videos, tactile recorders and even odor recorders are becoming available. . The new recording technology and the massive amounts of data require new means for selecting, displaying and sharing experiences. \r\n\r\n"}, {"language": "en", "title": "Copywrongs 2.0", "event_id": 8229, "start_time": "2016-12-28T16:00:00.000+01:00", "speaker_names": "Julia Reda", "track_id": 316, "room_id": 380, "duration": 3600, "abstract": "EU copyright reform plans threaten freedom of expression: Commissioner Günther Oettinger wants to make sharing even the tiniest snippets of news content subject to costly licensing, and obligate internet platforms to monitor all user uploads. We can still stop these proposals – if you join the fight now."}, {"language": "en", "title": "PUFs, protection, privacy, PRNGs", "event_id": 8231, "start_time": "2016-12-29T22:45:00.000+01:00", "speaker_names": "Pol Van Aubel", "track_id": 314, "room_id": 380, "duration": 1800, "abstract": "A physically unclonable function, or PUF, is some physical structure with properties that are easy to verify, hard to predict, and practically impossible to clone. Ideally, this means it's a device-unique unchanging identifier, which can be used for improving security. However, it can be at odds with privacy and anonymity. This talk will give you an overview of the thirty years of history behind PUFs, and will include the most recent advances in research. The functions, structure, and design will be discussed, as well as devices and materials that have properties to base PUFs on."}, {"language": "en", "title": "The woman behind your WiFi", "event_id": 8233, "start_time": "2016-12-29T20:30:00.000+01:00", "speaker_names": "Anja Drephal", "track_id": 314, "room_id": 380, "duration": 1800, "abstract": "Used in cell phone technology, bluetooth devices, and WiFi, Frequency Hopping Spread Spectrum (FHSS) is often said to have been invented in the early 1940s by none other than Hollywood actress and sex symbol Hedy Lamarr. This talk will present the undeniably entertaining history of a well-known actress moonlighting as a military inventor as well as give an overview of the 100-year-old history of frequency hopping and its past and present uses."}, {"language": "de", "title": "Es sind die kleinen Dinge im Leben", "event_id": 8237, "start_time": "2016-12-28T11:30:00.000+01:00", "speaker_names": "André Lampe", "track_id": 314, "room_id": 379, "duration": 1800, "abstract": "Jeder weiß ungefähr was ein Mikroskop ist und vielleicht hat man auch mal davon gehört das da immernoch dran geforscht wird – Stichwort Hochauflösungsmikroskopie (Nobelpreis 2014 in Chemie). Es gibt deutlich mehr Mikroskope in der professionellen Forschung als es Teleskope gibt, deutlich mehr – und da könnte man sich jetzt fragen: \"Warum sehe ich so viele Bilder von Sterne, aber kaum Mikroskopiebilder von öffentlichen Einrichtungen und Stellen?\". Um diese Frage zu beantworten will ich kurz in die Welt der Hochauflösungsmikroskopie einführen und die Techniken erklären. Ein bisschen über die Community erzählen und versuchen klar zu machen, warum es hier mit der Offenheit noch etwas hapert. UND: Es soll auch mikroskopiert werden."}, {"language": "en", "title": "Retail Surveillance / Retail Countersurveillance", "event_id": 8238, "start_time": "2016-12-30T13:00:00.000+01:00", "speaker_names": "Adam Harvey", "track_id": 315, "room_id": 380, "duration": 1800, "abstract": "From geo-magnetic tracking for smartphones to facial recognition for email marketing, from physical shopping cart fingerprinting to computer vision algorithms that use your clothing as metadata, this talk will explore the emerging landscape of hyper-competitive retail surveillance. Instead of dramatizing these technologies which can lead to calcification and normalization, the aim of this talk is to energize discourse around building creative solutions to counter, adapt to, or rethink emerging surveillance technologies."}, {"language": "en", "title": "33C3 Infrastructure Review", "event_id": 8243, "start_time": "2016-12-30T16:00:00.000+01:00", "speaker_names": "Leon", "track_id": 319, "room_id": 381, "duration": 3600, "abstract": "NOC, POC, VOC and QOC show interesting facts and figures as an excuse to present all the mischief they’ve been up to this year."}, {"language": "en", "title": "Eavesdropping on the Dark Cosmos", "event_id": 8245, "start_time": "2016-12-29T22:45:00.000+01:00", "speaker_names": "Simon Barke", "track_id": 323, "room_id": 379, "duration": 1800, "abstract": "Imagine, there is this huge data center but your user privileges allow you to access only 5% of the data. That is the exact same situation physicists face when trying to study the cosmos. 95% of our universe is made out of something that cannot be seen or touched. We generally call this unknown substance \"dark matter\" / \"dark energy\". The recent discovery of gravitational waves gives us a handle on the dark cosmos. We can now listen to invisible events in our universe. But there may also be other methods to shed light on the dark side."}, {"language": "en", "title": "Rebel Cities", "event_id": 8248, "start_time": "2016-12-30T13:45:00.000+01:00", "speaker_names": "renataavila", "track_id": 316, "room_id": 380, "duration": 1800, "abstract": "Cities are emerging as a space for local action and local change but also as dangerous spaces where social engineering, exclusion by design and privatised policing take place rapidly, without adequate frames to catch up and assure fundamental rights. Is the city the answer to a new digital ecosystem, with effective mechanisms to enforce it, in the local government powers? \r\n\r\nSophisticated surveillance systems are approved by, funded by and deployed by local authorities, Cities are emerging as the spaces where everything is controlled by invisible technology, almost imperceptible in daily life. Those surveillance cameras now visible on street corners are replaced by systems of constant monitoring integrated in the landscape. Cities of sensors collecting our data all day long, where each movement is registered and stored, where decisions are automated and dehumanised. Monetised to optimise consumption, predict behaviour. Control people and the local and micro local level. \r\n\r\nBut cities are also the spaces where a different form of politics is emerging, from Rome to Barcelona, from Madrid to Paris, citizens are taking back the domestic infrastructure. Is there the answer for digital sovereignty?\r\n"}, {"language": "de", "title": "Zwischen Technikbegeisterung und kritischer Reflexion: Chaos macht Schule", "event_id": 8262, "start_time": "2016-12-27T14:00:00.000+01:00", "speaker_names": "benni, Dorina", "track_id": 319, "room_id": 381, "duration": 3600, "abstract": "Die Lebenswelt von Kindern und Jugendlichen sowie die der Schulen könnte in Bezug auf die Digitalisierung kaum gegensätzlicher sein: Schülerinnen und Schüler leben und entfalten sich begeistert in der digitalen Welt, aber die Schule ist kaum in der Lage, Schülern ihre drängenden Fragen rund um die komplexe digitale Welt zu beantworten. In unserem Talk möchten wir anhand unserer Erfahrungen aus dem Projekt \"Chaos macht Schule\" u.a. diskutieren, wie man die heranwachsende Generation u. a. für Themen wie Datenschutz und Überwachung sensibilisieren und gleichzeitig Technikbegeisterung bei jungen Menschen fördern kann."}, {"language": "en", "title": "Hacking collective as a laboratory", "event_id": 8263, "start_time": "2016-12-29T22:00:00.000+01:00", "speaker_names": "Ezi", "track_id": 314, "room_id": 382, "duration": 1800, "abstract": "Talk presents findings from sociological investigation on hacking collectives. I will try to answer the question whether hacking collectives are laboratories, as seen by sociology of science. I will also show some peculiar traits of hacking collective, beneficial both for sciences and societies. Perhaps academia needs hackers more than it’s willing to admit? "}, {"language": "de", "title": "Netzpolitik in der Schweiz 2016", "event_id": 8264, "start_time": "2016-12-27T20:30:00.000+01:00", "speaker_names": "Hakuna MaMate", "track_id": 319, "room_id": 382, "duration": 3600, "abstract": "Ein Überblick zur netzpolitischen Situation in der Schweiz. Wir geben einen umfassenden Rückblick auf das ereignissreiche Jahr 2016, in dem die Schweizer Bevölkerung über gleich zwei Massenüberwachungsgesetze entschieden hat. Die netzpolitischen Gruppierungen haben mit viel Einsatz gegen die Gesetze gekämpft . Wir berichten darüber, wie wir das angengangen sind, wie es ausgegangen ist und was wir dabei gelernt haben."}, {"language": "en", "title": "Der 33 Jahrerückblick", "event_id": 8266, "start_time": "2016-12-28T11:30:00.000+01:00", "speaker_names": "maxigas, mel", "track_id": 316, "room_id": 380, "duration": 1800, "abstract": "The proper relationship of technology and politics have been the subject of an evergreen debate on the floor of the Chaos Communication Congress.  Rather than taking a position in this debate, we are asking how the two have been co-articulated in practice so far by CCC participants?"}, {"language": "en", "title": "Hebocon", "event_id": 8270, "start_time": "2016-12-29T23:30:00.000+01:00", "speaker_names": "Konfusius", "track_id": 320, "room_id": 381, "duration": 3600, "abstract": "Join with your derpy bot to fight your nemesis! Push it off the table or knock the enemy over. No weapons. No advanced controllers. No tears. Don't take it serious. "}, {"language": "en", "title": "On Smart Cities, Smart Energy, And Dumb Security", "event_id": 8272, "start_time": "2016-12-29T12:45:00.000+01:00", "speaker_names": "Netanel Rubin", "track_id": 318, "room_id": 380, "duration": 3600, "abstract": "Smart City is an abstract concept everyone talks about but no one knows what it actually means. No one, except Energy utilities.\r\nIn this talk we will explore the vast world of Smart Energy, and see how energy providers used the \"Smart City\" concept to get better control over our energy consumption, all while almost completely ignoring security aspects along the way.\r\nJoin me and see how Smart Energy is making our lives a little bit better, but also dangerously insecure."}, {"language": "en", "title": "ATMs how to break them to stop the fraud", "event_id": 8273, "start_time": "2016-12-28T23:00:00.000+01:00", "speaker_names": "Olga Kochetova, Alexey Osipov", "track_id": 318, "room_id": 381, "duration": 3600, "abstract": "How to stop the ATMs fraud? How to protect ATMs from attacks such as black box jackpotting? How to prevent network hijacking such as rogue processing center or MiTM? Some of these issues can be fixed by configuration means, some fixed by compensation measures, but many only by vendor. We will tell you about what bank can do now and what we as a community of security specialists should force to vendors."}, {"language": "en", "title": "Back to the 16bit Era", "event_id": 8274, "start_time": "2016-12-27T19:00:00.000+01:00", "speaker_names": "kirschju", "track_id": 317, "room_id": 381, "duration": 1800, "abstract": "This talk describes the journey of dissecting the old \"Kellogg's\" Jump'n'Run DOS game developed back in 1994 by Rauser Advertainment and Factor 5. We summarize a 9 months effort of creating a full-fledged map editor for this game, covering the structure of the game's data files, nifty VGA programming tricks as well as insane space-optimization strategies employed by the original developers. Prepare for tons of data structures, bit magic, and of course 16 bit x86 assembly code."}, {"language": "de", "title": "Von Alpakas, Hasenbären und Einhörnern – Über Anerkennungskultur", "event_id": 8280, "start_time": "2016-12-29T20:30:00.000+01:00", "speaker_names": "Maria Reimer, Daniel seitz, Paula Glaser, Robert Alisch", "track_id": 316, "room_id": 382, "duration": 1800, "abstract": "Wie würdigen verschiedene Tech-Communities das ehrenamtliche Engagement ihrer Mitglieder? Wie lassen sich gewünschte Lernprozesse verstärken? Was sind unsere Erfahrungen bei Jugend hackt? Und was haben Badges damit zu tun?"}, {"language": "en", "title": "Understanding the Snooper’s Charter", "event_id": 8287, "start_time": "2016-12-30T14:30:00.000+01:00", "speaker_names": "Hendrik Obelöer", "track_id": 316, "room_id": 382, "duration": 1800, "abstract": "The ‚Investigative Powers Bill‘ is about to become law in the UK. Its provisions, from looking up Internet connection records without a warrant to forcing communication service providers to assist with interception and decryption of data, have caused an outcry in the Western world. But how and why did British politics get here? And, most importantly of all: How could we fight back?"}, {"language": "de", "title": "Bonsai Kitten waren mir lieber - Rechte Falschmeldungen in sozialen Netzwerken", "event_id": 8288, "start_time": "2016-12-27T19:00:00.000+01:00", "speaker_names": "fraulutz, NoAverageRobot", "track_id": 316, "room_id": 380, "duration": 1800, "abstract": "Auf der Hoaxmap werden seit vergangenem Februar Gerüchte über Geflüchtete und deren Widerlegungen gesammelt, sortiert und in Kartenform präsentiert. Die Themen sind dabei so vielfältig wie die Erzählformen."}, {"language": "de", "title": "Netzpolitik in Österreich", "event_id": 8293, "start_time": "2016-12-27T21:45:00.000+01:00", "speaker_names": "Werner Reiter, Thomas Lohninger, Alexander Czadilek", "track_id": 319, "room_id": 382, "duration": 3600, "abstract": "Die Netzpolitik der österreichischen Bundesregierung hat sich im Jahr 2016 nicht besser dargestellt als die Jahre davor: Neue Überwachungsgesetze, (bislang erfolgreich verhinderte) Versuche eine staatliche Spionagesoftware  (Bundestrojaner) einzuführen, der ewige Kampf um ein Transparenzgesetz, eine scheinheilige Simulation demokratischer Partizipation und das totglaubte E-Voting sind brennende Themen und bedürfen einer breiten gesellschaftlichen Diskussion. Der AKVorrat zeigt in einem netzpolitischen Jahresrückblick, was wir dagegen tun können und zeigt, dass Zivilgesellschaft wirkt. "}, {"language": "en", "title": "The Fight for Encryption in 2016", "event_id": 8295, "start_time": "2016-12-27T12:45:00.000+01:00", "speaker_names": "Kurt Opsahl", "track_id": 316, "room_id": 379, "duration": 3600, "abstract": "Both strong end-to-end communications encryption and device encryption are legal in most jurisdictions today, and remain widely available. Yet software programers and hardware producers are increasingly under pressure from law enforcement and policy makers around the world to include so-called backdoors in encryption products. In this lecture, I will provide the state of the law as we moving into 2017, detailing what happened in the fight between Apple and the FBI in San Bernardino and the current proposals to weaken or ban encryption, covering proposed and recently enacted laws. I will also discuss the extra-legal pressures placed upon companies, and the rise of government hacking and state-sponsored malware as an alternative or addition to weakening software. Finally, the presentation will discuss possible realistic outcomes, and give my predictions on what the state of the law will be as we head into 2017, and discuss how we can fight for a future that will allow for secure communications for everyone.\r\n"}, {"language": "en", "title": "Bootstraping a slightly more secure laptop", "event_id": 8314, "start_time": "2016-12-27T14:00:00.000+01:00", "speaker_names": "Trammell Hudson", "track_id": 318, "room_id": 379, "duration": 3600, "abstract": "Heads is an open source custom firmware and OS configuration for laptops and servers that aims to provide slightly better physical security and protection for data on the system. Unlike Tails, which aims to be a stateless OS that leaves no trace on the computer of its presence, Heads is intended for the case where you need to store data and state on the computer. It targets specific models of commodity hardware and takes advantage of lessons learned from several years of vulnerability research. This talk provides a high level overview of Heads, a demo of installing it on a Thinkpad and a tour of some of the attacks that it protects against."}, {"language": "en", "title": "A world without blockchain", "event_id": 8315, "start_time": "2016-12-28T18:30:00.000+01:00", "speaker_names": "Mark van Cuijk", "track_id": 316, "room_id": 382, "duration": 3600, "abstract": "Instant money transfer, globally without borders and 24/7. That’s one of the promises of Bitcoin. But how does national and international money transfer work in the world of banks?"}, {"language": "en", "title": "Hacking Reality ", "event_id": 8317, "start_time": "2016-12-28T16:00:00.000+01:00", "speaker_names": "Kate Genevieve ", "track_id": 315, "room_id": 382, "duration": 3600, "abstract": "Inspired by a long history of bold reality hacks this talk considers the kinds of potentials opening up through emerging Virtual Reality (VR) and Mixed Reality technologies. In this current moment of climate crisis and structural metamorphosis how can we work with powerful immersive technologies to understand our own perceptual systems, to radically communicate and to innovate new ways of being together?"}, {"language": "en", "title": "The High Priests of the Digital Age", "event_id": 8324, "start_time": "2016-12-30T12:15:00.000+01:00", "speaker_names": "catchthewhistle", "track_id": 316, "room_id": 379, "duration": 1800, "abstract": "The High Priests of the Digital Age Are Working Behind Your Back to Make You Confess, and Repent."}, {"language": "en", "title": "The Zcash anonymous cryptocurrency", "event_id": 8330, "start_time": "2016-12-29T23:30:00.000+01:00", "speaker_names": "pesco", "track_id": 314, "room_id": 380, "duration": 1800, "abstract": "Zcash is the third iteration of an extension to the Bitcoin protocol that provides true untraceability, i.e. fully anonymous transactions. It is arguably the first serious attempt to establish this extension, in the form of its own blockchain, beyond the form of an academic proposal. The talk provides an introduction to the magic that makes it work."}, {"language": "en", "title": "Talking Behind Your Back", "event_id": 8336, "start_time": "2016-12-29T17:15:00.000+01:00", "speaker_names": "Vasilios Mavroudis, Federico Maggi", "track_id": 318, "room_id": 382, "duration": 3600, "abstract": "In the last two years, the marketing industry started to show a fast increasing interest in technologies for user cross-device tracking, proximity tracking, and their derivative monetization schemes. To meet these demands, a new ultrasound-based technology has recently emerged and is already utilized in a number of different real-world applications. Ultrasound tracking comes with a number of desirable features (e.g., easy to deploy, inaudible to humans), but alarmingly until now no comprehensive security analysis of the technology has been conducted. In this talk, we will publish the results of our security analysis of the ultrasound tracking ecosystem, and demonstrate the practical security and privacy risks that arise with its adoption. Subsequently, we will introduce some immediately deployable defense mechanisms for practitioners, researchers, and everyday users. Finally, we will initiate the discussion for the standardization of ultrasound beacons, and outline our proposed OS-level API that enables both secure and effortless deployment for ultrasound-enabled applications."}, {"language": "en", "title": "Building a high throughput low-latency PCIe based SDR", "event_id": 8338, "start_time": "2016-12-27T12:45:00.000+01:00", "speaker_names": "ipse, Sergey Kostanbaev", "track_id": 317, "room_id": 381, "duration": 3600, "abstract": "Software Defined Radios (SDRs) became a mainstream tool for wireless engineers and security researches and there are plenty of them available on the market. Most if not all SDRs in the affordable price range are using USB2/USB3 as a transport, because of implementation simplicity. While being so popular, USB has limited bandwidth, high latency and is not really suitable for embedded applications. PCIe/miniPCIe is the only widespread bus which is embedded friendly, low latency and high bandwidth at the same time. But implementing PCIe/miniPCIe is not for the faint of heart - you have to write your own FPGA code, write your own Linux kernel driver and ensure compatibility with different chipsets, each with its own quirks. In this talk we will look at the requirements for a high performance SDR like XTRX, how this leads to certain design decisions and share pitfalls and gotchas we encountered (and solved)."}, {"language": "en", "title": "Nintendo Hacking 2016", "event_id": 8344, "start_time": "2016-12-27T20:30:00.000+01:00", "speaker_names": "derrek, nedwill, naehrwert", "track_id": 318, "room_id": 380, "duration": 3600, "abstract": "This talk will give a unique insight of what happens when consoles have been hacked already, but not all secrets are busted yet.\r\nThis time we will not only focus on the Nintendo 3DS but also on the Wii U, talking about our experiences wrapping up the end of an era.\r\nWe will show how we managed to exploit them in novel ways and discuss why we think that Nintendo has lost the game."}, {"language": "en", "title": "Deploying TLS 1.3: the great, the good and the bad", "event_id": 8348, "start_time": "2016-12-27T21:45:00.000+01:00", "speaker_names": "Filippo Valsorda", "track_id": 318, "room_id": 380, "duration": 3600, "abstract": "Transport Layer Security (TLS) 1.3 is almost here. The protocol that protects most of the Internet secure connections is getting the biggest ever revamp, and is losing a round-trip. We will explore differences between TLS 1.3 and previous versions in detail, focusing on the security improvements of the new protocol as well as some of the challenges we face around securely implementing new features such as 0-RTT resumption. At Cloudflare we will be the first to deploy TLS 1.3 on a wide scale, and we’ll be able to discuss the insights we gained while implementing and deploying this protocol."}, {"language": "en", "title": "Hacking the World", "event_id": 8349, "start_time": "2016-12-28T13:00:00.000+01:00", "speaker_names": "Claudio \"nex\" Guarnieri", "track_id": 316, "room_id": 379, "duration": 1800, "abstract": "In this lecture I wish to reflect on the maturation of the security and hacking communities and their role in larger societal and political participation. We'll reflect on the predominant role that technology has been growing into our lives, and the responsibilities we have in nurturing it. After having spent the last years in researching, exposing, and preventing the electronic targeting of dissidents and journalists, I hope to synthesize my experience and suggest how to reconsider our tactics, the successes, and the failures, and hopefully draw some inspiration for a brighter future."}, {"language": "en", "title": "Mass Surveillance through Computational Linguistics and Human Language Technology", "event_id": 8366, "start_time": "2016-12-30T11:30:00.000+01:00", "speaker_names": "hernani", "track_id": 314, "room_id": 380, "duration": 1800, "abstract": "Eventhough the Snowden revelations for the first time clearly show that mass surveillance of communications is carried out on a global level, little knowledge seems to be available to the general public as well as the hacker community how these so-called COMINT operations actually work. The talk focusses on mass surveillance based on methods known from research of the interdiscplinary field of Computationanal Linguistics (or Natural Language Processing) and demonstrates how generation of selectors for mass surveilling text messages can occur."}, {"language": "en", "title": "Machine Dreams", "event_id": 8369, "start_time": "2016-12-29T16:00:00.000+01:00", "speaker_names": "Joscha", "track_id": 316, "room_id": 380, "duration": 3600, "abstract": "Artificial Intelligence provides a conceptual framework to understand mind and universe in new ways, clearing the obstacles that hindered the progress of philosophy and psychology. Let us see how AI can help us to understand how our minds create the experience of a universe."}, {"language": "de", "title": "Kampf dem Abmahnunwesen", "event_id": 8388, "start_time": "2016-12-27T16:45:00.000+01:00", "speaker_names": "Beata Hubrig, erdgeist", "track_id": 319, "room_id": 381, "duration": 1800, "abstract": "Im Spannungsfeld zwischen der Vorderfront der Computertechnik und einem Spezialbereich des Urheberrechts hat sich eine Industrie eine Nische geschaffen, in der sie durch Hochspezialisierung und Automatisierung ein einträgliches Geschäft aufgezogen haben. Dabei nehmen sie als Kollateralschaden in Kauf, dass Unschuldige durch die Drohkulisse zum Zahlen bewegt und zum Schließen ihres offenen Netzwerks gebracht werden. Wir beschreiben, was man dagegen tun kann und was wir dagegen schon getan haben."}, {"language": "en", "title": "Shining some light on the Amazon Dash button", "event_id": 8398, "start_time": "2016-12-28T23:00:00.000+01:00", "speaker_names": "hunz", "track_id": 317, "room_id": 380, "duration": 3600, "abstract": "This talk will explore the hard- and software of the Amazon Dash button."}, {"language": "en", "title": "Reverse engineering Outernet", "event_id": 8399, "start_time": "2016-12-27T11:30:00.000+01:00", "speaker_names": "Daniel Estévez", "track_id": 317, "room_id": 380, "duration": 3600, "abstract": "<a href=\"https://outernet.is\">Outernet</a> is a company whose goal is to ease worldwide access to internet contents by broadcasting files through geostationary satellites. Most of the software used for Outernet is open source, but the key parts of their receiver are closed source and the protocols and specifications of the signal used are secret. I have been able to <a href=\"http://destevez.net/tag/outernet/\">reverse engineer</a> most of the protocols, and a functional <a href=\"https://github.com/daniestevez/free-outernet\">open source</a> receiver is now available."}, {"language": "de", "title": "CCC-Jahresrückblick 2016", "event_id": 8401, "start_time": "2016-12-29T12:45:00.000+01:00", "speaker_names": "frank, Linus Neumann, Constanze Kurz, nexus", "track_id": 319, "room_id": 379, "duration": 8100, "abstract": "Wir werden einen Überblick über die Themen geben, die den Chaos Computer Club 2016 beschäftigt haben. Neben der Zusammenfassung und der Rückschau auf das vergangene Jahr wollen wir einen Blick in die Zukunft wagen."}, {"language": "en", "title": "Prediction Fail", "event_id": 8404, "start_time": "2016-12-30T11:30:00.000+01:00", "speaker_names": "Hito Steyerl", "track_id": 315, "room_id": 381, "duration": 3600, "abstract": "We will work in several modules including International Dirty Left and Future Infrastructures. This event requires active participation in small groups. It is not meant to entertain, inform or educate, it is not a performance, this is not a drill. It has clear rules that can be changed by consent. It is a game, but all games are real these days. We dont ask your approval but require your enthusiasm.\r\n"}, {"language": "en", "title": "The Moon and European Space Exploration", "event_id": 8406, "start_time": "2016-12-29T20:30:00.000+01:00", "speaker_names": "Jan Wörner", "track_id": 323, "room_id": 379, "duration": 1800, "abstract": "Since the early successes of moon missions in the Sixtie, mankind has moved on to the earth orbit and other deep space missions. But interest in the moon as a target has intensified recently as the strategies for future missions are evolving."}, {"language": "en", "title": "An Elevator to the Moon (and back)", "event_id": 8407, "start_time": "2016-12-29T18:30:00.000+01:00", "speaker_names": "Markus Landgraf", "track_id": 323, "room_id": 380, "duration": 3600, "abstract": "Why is it so hard to go to the Moon? The curse of Newtonian Mechanics and Tsiolkovsky's Rocket Equation force us to build huge rockets to achieve any meaningful activity on the Moon. There are two strategies to hack the laws of celestial mechanics: making fuel on the Moon and using cables to climb out of the gravity well. Here we focus on the latter, which is the Moon version of the famous space elevator. The difference to an Earth elevator is - anelevator to the Moon's surface is realistic with today's materials. In the talk an introduction to the general problem is given and a starting point for a discussion is given that can easily lead to a sustainable access to the Moon if there is demand to do so.\r\n"}, {"language": "en", "title": "Keys of Fury", "event_id": 8408, "start_time": "2016-12-27T19:00:00.000+01:00", "speaker_names": "raquel meyers", "track_id": 315, "room_id": 382, "duration": 1800, "abstract": "Keys Of Fury is a brutalist storytelling about technology and keystrokes where text is used unadorned and roughcast, like concrete. I define my practice as KYBDslöjd (drawing by Type In) who uses the Commodore 64 computer, Teletext technologies and Typewriter. Brutalism has an unfortunate reputation of evoking a raw dystopia and KYBDslöjd evokes an “object of nostalgia”. But nostalgic, ‪retro‬, obsolete or ‪limited‬ are rhetoric qualities earn by constant repetition. We live in a time where hardware and software become obsolete before most of the users have learned how to use them or disappear into pure functionality. The obedience to standards who made us passive observers and consumers. "}, {"language": "en", "title": " From Server Farm to Data Table", "event_id": 8412, "start_time": "2016-12-28T12:15:00.000+01:00", "speaker_names": "Ingrid Burrington", "track_id": 315, "room_id": 382, "duration": 1800, "abstract": "\r\nEarly digital computers were the size of rooms. While the devices have gotten smaller, because of the increasingly networked nature of technology the room has gotten bigger--it's ceased having walls and started to cover the ocean floor and ascend into low earth orbit. While Neal Stephenson may have cornered this living-inside-a-computer narrative in 1996 with \"Mother Earth, Mother Board\", in the past twenty years the seams of the network have become even more opaque, subsumed into The Cloud and other problematic abstractions. This talk will mostly be about different approaches to documenting, comprehending, and thinking about network infrastructure and the ways that the visual vernacular of technologies shape their history and politics. \r\n\r\n"}, {"language": "de", "title": "Security Nightmares 0x11", "event_id": 8413, "start_time": "2016-12-30T17:15:00.000+01:00", "speaker_names": "frank, Ron", "track_id": 319, "room_id": 379, "duration": 3600, "abstract": "Was hat sich im letzten Jahr im Bereich IT-Sicherheit getan? Welche neuen Entwicklungen haben sich ergeben? Welche neuen Buzzwords und Trends waren zu sehen?"}, {"language": "en", "title": "Corporate surveillance, digital tracking, big data & privacy", "event_id": 8414, "start_time": "2016-12-29T11:30:00.000+01:00", "speaker_names": "wchr", "track_id": 316, "room_id": 382, "duration": 3600, "abstract": "Today virtually everything we do is monitored in some way. The collection, analysis and utilization of digital information about our clicks, swipes, likes, purchases, movements, behaviors and interests have become part of everyday life. While individuals become increasingly transparent, companies take control of the recorded data."}, {"language": "de", "title": "Von Kaffeeriechern, Abtrittanbietern und Fischbeinreißern", "event_id": 8418, "start_time": "2016-12-28T14:30:00.000+01:00", "speaker_names": "Michaela Vieser", "track_id": 315, "room_id": 382, "duration": 1800, "abstract": ""}, {"language": "en", "title": "The Clash of Digitalizations", "event_id": 8419, "start_time": "2016-12-29T21:15:00.000+01:00", "speaker_names": "Saud Al-Zaid", "track_id": 315, "room_id": 382, "duration": 1800, "abstract": "This talk discusses the representation of Arab males in video games and the adverse effect it has on the collective political imagination. Anonymous military-aged Arab men become increasingly the exception to the laws of human rights, and become default targets for conventional and unmanned drone attacks. This devolution is seen through the lens of the changing nature of conflict through digitalization, the collapse of the nation state in Iraq and Syria, and the future of war. "}, {"language": "en", "title": "Anthropology for kids - What is privacy?", "event_id": 8420, "start_time": "2016-12-27T16:45:00.000+01:00", "speaker_names": "Nika Dubrovsky", "track_id": 315, "room_id": 382, "duration": 1800, "abstract": "I would like to present my project called Anthropology for kids and a specific book, that I am working on in the larger framework of this project.  \r\nThis book will look like an ordinary school notebook in which a teacher checks a student if the lesson had been learnt. But it is actually not! I gathered this collection of historical and anthropological notes, so that together with school kids we can think about how the very idea of privacy was developed in different countries and in different historical epochs. In ancient Babylon wealthy women were allowed to cover their faces and their bodies, but the poor ones were not. In the Soviet Union during Stalin times it was dangerous to tell a political joke even in the group of close friends. One of them may report a joke to the authorities. Punishment for a political joke could be a prison sentence. \r\nToday more or less all our online communication is watched or recorded by authorities.\r\nHow does our present relate to other times in history, how is the western notion of privacy related to the ideas in other cultures."}, {"language": "en", "title": "The Global Assassination Grid", "event_id": 8425, "start_time": "2016-12-27T11:30:00.000+01:00", "speaker_names": "Cian Westmoreland", "track_id": 316, "room_id": 379, "duration": 3600, "abstract": "As they say in the Air Force, ‚No comms no bombs‘,  – A technician’s insight into the invisible networks governing military drones and the quest for accountability"}, {"language": "en", "title": "33C3 Closing Ceremony", "event_id": 8428, "start_time": "2016-12-30T18:30:00.000+01:00", "speaker_names": "Nicolas Wöhrl, @ReinhardRemfort", "track_id": 319, "room_id": 379, "duration": 1800, "abstract": ""}, {"language": "en", "title": "33C3 Opening Ceremony", "event_id": 8429, "start_time": "2016-12-27T11:00:00.000+01:00", "speaker_names": "anna, elisa", "track_id": 319, "room_id": 379, "duration": 1800, "abstract": ""}, {"language": "en", "title": "Space Flyers", "event_id": 8433, "start_time": null, "speaker_names": "Christoffer Jerkeby, raquel meyers", "track_id": 315, "room_id": null, "duration": 3600, "abstract": "A live performance by kugg (SE) & raquel meyers (ES/SE)\r\nKugg // oldschool futuristic (new retro wave) & disco space music\r\nraquel meyers // C64 PETSCII visuals set"}, {"language": "en", "title": "No Love for the US Gov.", "event_id": 8438, "start_time": "2016-12-29T18:30:00.000+01:00", "speaker_names": "Jake Davis, Tor Ekeland, Lauri Love", "track_id": 316, "room_id": 379, "duration": 3600, "abstract": "Lauri Love has never set foot in the United States, yet he is facing\r\na potential century in jail if extradited for his alleged involvement\r\nin #OpLastResort, an Anonymous-related protest action that occurred in\r\nresponse to the death of Aaron Swartz. The case against Love, a\r\nFinnish and UK citizen, has profound implications for United States\r\nclaims of global jurisdiction over the internet, for the treatment of\r\nneurodivergent individuals under the law, and for privacy rights in\r\nthe UK and beyond."}, {"language": "de", "title": "NSU Monologe", "event_id": 8440, "start_time": "2016-12-28T20:30:00.000+01:00", "speaker_names": "Bühne für Menschenrechte", "track_id": 315, "room_id": 379, "duration": 8100, "abstract": "with English and  Turkish Overtitels"}, {"language": "en", "title": "JODI - Apache is functioning normally ", "event_id": 8444, "start_time": "2016-12-29T22:00:00.000+01:00", "speaker_names": "DI, JO", "track_id": 315, "room_id": 381, "duration": 1800, "abstract": "Joan Heemskerk and Dirk Paesmans, collectively known as JODI, are rightfully venerated for their countless contributions to art and technology, working as an artistic duo since the mid-90’s. "}]